# DataFrame

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [10]:
data = {
    "Nama": ["Adit", "Budi", "Cici"],
    "Nilai": [80, 90, 85],
    "Jurusan": ["Akuntansi", "Manajemen", "Ekonomi"]
}

df = pd.DataFrame(data, index=['A', 'B', 'C'], )
print(df)

   Nama  Nilai    Jurusan
A  Adit     80  Akuntansi
B  Budi     90  Manajemen
C  Cici     85    Ekonomi

In [4]:
np.random.seed(100)

In [53]:
dataku = pd.DataFrame(np.random.randn(3, 5), index=['A', 'B', 'C'], columns=['satu','dua','tiga','empat','lima'])

In [54]:
dataku

       satu       dua      tiga     empat      lima
A  0.222400 -1.443217 -0.756352  0.816454  0.750445
B -0.455947  1.189622 -1.690617 -1.356399 -1.232435
C -0.544439 -0.668172  0.007315 -0.612939  1.299748

In [11]:
dataku['tiga']

A    1.153036
B   -1.070043
C   -0.583595
Name: tiga, dtype: float64

In [14]:
# iloc dan loc

In [31]:
dataku['baru'] = dataku['empat'] + dataku['lima'] #Menambah kolom + op mamematika

In [32]:
dataku

       satu      tiga     empat      lima      enam      baru
A -0.104411  1.029733 -0.438136 -1.118318 -1.556454 -1.556454
B  1.618982 -0.251879 -0.842436  0.184519 -0.657917 -0.657917
C  0.937082  1.361556 -0.326238  0.055676 -0.270562 -0.270562

In [35]:
dataku.drop('baru', axis=1, inplace=True) # Axis 0 = Index | Axis 1 = Kolom

In [36]:
dataku

       satu      tiga     empat      lima      enam
A -0.104411  1.029733 -0.438136 -1.118318 -1.556454
B  1.618982 -0.251879 -0.842436  0.184519 -0.657917
C  0.937082  1.361556 -0.326238  0.055676 -0.270562

In [37]:
dataku.drop('B', axis=0, inplace=True)

In [58]:
dataku

       satu       dua      tiga     empat      lima
C -0.544439 -0.668172  0.007315 -0.612939  1.299748

In [55]:
dataku.shape

(3, 5)

In [56]:
dataku = dataku[dataku['tiga']>0]

In [57]:
dataku

       satu       dua      tiga     empat      lima
C -0.544439 -0.668172  0.007315 -0.612939  1.299748